status/2022/0722.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>16 July 2022 - 22 July 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">16 July 2022 - 22 July 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0fe32cf">1. MIT OCW</a>
<ul>
<li><a href="#org15810df">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org25742d1">1.1.1. Session 73, PS9 con't.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb3b05c6">2. Emergency Crystal Radio</a>
<ul>
<li><a href="#org4861f52">2.1. Have inductor selector - started desoldering</a></li>
</ul>
</li>
<li><a href="#org465906c">3. Mill Controller #2</a>
<ul>
<li><a href="#orgcf881b9">3.1. Need to clone existing HD</a></li>
<li><a href="#orgb1c4e8f">3.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#orgcacb4d1">3.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#orgff51a27">3.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2e6f4fc">4. Alum Rock Data Center</a>
<ul>
<li><a href="#org9573c6e">4.1. Using CentOS 7 for now - good until 2024?</a></li>
<li><a href="#org921158e">4.2. need to check alma, rocky, others? for suitability</a></li>
</ul>
</li>
<li><a href="#org24a1ca7">5. OLPC</a>
<ul>
<li><a href="#org26685e7">5.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#orge175436">6. Virtual Orchestra</a>
<ul>
<li><a href="#org4697367">6.1. sfz file tests</a>
<ul>
<li><a href="#org4306a87">6.1.1. Started new audio tool program to replace aftools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcdf0ca0">7. More project ideas</a>
<ul>
<li><a href="#org888b54c">7.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org3da110e">7.2. ENIAC simulation in verilog</a></li>
<li><a href="#org2fb78f7">7.3. GMPForth ports to SIMH, DYCyber targets</a></li>
<li><a href="#org855c689">7.4. GMPASM assembler</a></li>
</ul>
</li>
<li><a href="#orgcc20ed4">8. David Davies</a>
<ul>
<li><a href="#org0fcfa20">8.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orgd33be99">8.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#orgcf36ec9">8.3. Next hearing 9/6/2022</a></li>
</ul>
</li>
<li><a href="#org9141e2a">9. Peter Kim</a>
<ul>
<li><a href="#org081839c">9.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org3fe98b4">9.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org42495fd">9.3. Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</a></li>
<li><a href="#orgdf8f14f">9.4. Sentencing 9/20/2022</a></li>
</ul>
</li>
<li><a href="#org1b394fb">10. Books</a>
<ul>
<li><a href="#org537f934">10.1. The Elephant in the Universe - Govert Schilling</a></li>
<li><a href="#org584c2d1">10.2. Higher Speculations - Helge Kragh</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0fe32cf" class="outline-2">
<h2 id="org0fe32cf"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org15810df" class="outline-3">
<h3 id="org15810df"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org25742d1" class="outline-4">
<h4 id="org25742d1"><span class="section-number-4">1.1.1.</span> Session 73, PS9 con't.</h4>
</div>
</div>
</div>
<div id="outline-container-orgb3b05c6" class="outline-2">
<h2 id="orgb3b05c6"><span class="section-number-2">2.</span> Emergency Crystal Radio</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4861f52" class="outline-3">
<h3 id="org4861f52"><span class="section-number-3">2.1.</span> Have inductor selector - started desoldering</h3>
</div>
</div>
<div id="outline-container-org465906c" class="outline-2">
<h2 id="org465906c"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgcf881b9" class="outline-3">
<h3 id="orgcf881b9"><span class="section-number-3">3.1.</span> Need to clone existing HD</h3>
</div>
<div id="outline-container-orgb1c4e8f" class="outline-3">
<h3 id="orgb1c4e8f"><span class="section-number-3">3.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgcacb4d1" class="outline-4">
<h4 id="orgcacb4d1"><span class="section-number-4">3.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-orgff51a27" class="outline-4">
<h4 id="orgff51a27"><span class="section-number-4">3.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org2e6f4fc" class="outline-2">
<h2 id="org2e6f4fc"><span class="section-number-2">4.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9573c6e" class="outline-3">
<h3 id="org9573c6e"><span class="section-number-3">4.1.</span> Using CentOS 7 for now - good until 2024?</h3>
</div>
<div id="outline-container-org921158e" class="outline-3">
<h3 id="org921158e"><span class="section-number-3">4.2.</span> need to check alma, rocky, others? for suitability</h3>
</div>
</div>
<div id="outline-container-org24a1ca7" class="outline-2">
<h2 id="org24a1ca7"><span class="section-number-2">5.</span> OLPC</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org26685e7" class="outline-3">
<h3 id="org26685e7"><span class="section-number-3">5.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-orge175436" class="outline-2">
<h2 id="orge175436"><span class="section-number-2">6.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org4697367" class="outline-3">
<h3 id="org4697367"><span class="section-number-3">6.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org4306a87" class="outline-4">
<h4 id="org4306a87"><span class="section-number-4">6.1.1.</span> Started new audio tool program to replace aftools</h4>
</div>
</div>
</div>
<div id="outline-container-orgcdf0ca0" class="outline-2">
<h2 id="orgcdf0ca0"><span class="section-number-2">7.</span> More project ideas</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org888b54c" class="outline-3">
<h3 id="org888b54c"><span class="section-number-3">7.1.</span> Zuse Z3 simulation in Verilog</h3>
</div>
<div id="outline-container-org3da110e" class="outline-3">
<h3 id="org3da110e"><span class="section-number-3">7.2.</span> ENIAC simulation in verilog</h3>
</div>
<div id="outline-container-org2fb78f7" class="outline-3">
<h3 id="org2fb78f7"><span class="section-number-3">7.3.</span> GMPForth ports to SIMH, DYCyber targets</h3>
</div>
<div id="outline-container-org855c689" class="outline-3">
<h3 id="org855c689"><span class="section-number-3">7.4.</span> GMPASM assembler</h3>
</div>
</div>
<div id="outline-container-orgcc20ed4" class="outline-2">
<h2 id="orgcc20ed4"><span class="section-number-2">8.</span> David Davies</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org0fcfa20" class="outline-3">
<h3 id="org0fcfa20"><span class="section-number-3">8.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orgd33be99" class="outline-3">
<h3 id="orgd33be99"><span class="section-number-3">8.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-orgcf36ec9" class="outline-3">
<h3 id="orgcf36ec9"><span class="section-number-3">8.3.</span> Next hearing 9/6/2022</h3>
</div>
</div>
<div id="outline-container-org9141e2a" class="outline-2">
<h2 id="org9141e2a"><span class="section-number-2">9.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org081839c" class="outline-3">
<h3 id="org081839c"><span class="section-number-3">9.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org3fe98b4" class="outline-3">
<h3 id="org3fe98b4"><span class="section-number-3">9.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org42495fd" class="outline-3">
<h3 id="org42495fd"><span class="section-number-3">9.3.</span> Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</h3>
</div>
<div id="outline-container-orgdf8f14f" class="outline-3">
<h3 id="orgdf8f14f"><span class="section-number-3">9.4.</span> Sentencing 9/20/2022</h3>
</div>
</div>
<div id="outline-container-org1b394fb" class="outline-2">
<h2 id="org1b394fb"><span class="section-number-2">10.</span> Books</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org537f934" class="outline-3">
<h3 id="org537f934"><span class="section-number-3">10.1.</span> The Elephant in the Universe - Govert Schilling</h3>
</div>
<div id="outline-container-org584c2d1" class="outline-3">
<h3 id="org584c2d1"><span class="section-number-3">10.2.</span> Higher Speculations - Helge Kragh</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:04</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
